{"medium_time_arithmetic_p1.json": {"question": "Let the answer to Question1 be X.\n\nQuestion1: Rachel was born on 2012-Apr-05 and Brad was born on 2013-Jan-21. How many days is Rachel older than Brad? Your answer should be the number of days without the unit (for example, 233).\n\nLet the answer to Question2 be Y.\n\nQuestion2: Elizabeth and William were born on 2022-May-17 and 2022-Oct-31 respectively. When William was 333 days old, how old was Elizabeth in days? Your answer should be the number of days without the unit (for example, 233).\n\nLet X' = X - 276 and Y' = Y - 472.\n\nUse these values to solve Question3.\n\nQuestion3: Alan and Mary tried a new restaurant on  05-Y'-2002 and really liked it. They decided to go to the same restaurant every X' days. If today is 07-24-2002, when is the next time they will go to that restaurant? Use the date format in the question to report the result.", "source": "medium_time_arithmetic_p1.json", "gt_answer": "07-27-2002"}, "medium_time_arithmetic_p0.json": {"question": "Let the answer to Question1 be X, Y, Z.\n\nQuestion1: The average time taken to clean a car is 57 minutes and 34 seconds. Calculate the time taken to clean 18 cars at the same rate. Your answer should be the value of X, Y, and Z, respectively (for example, 2, 5, 10).\n\nLet X' = X - 15, Y' = Y - 16, and Z' = Z - 2.\n\nLet the answer to Question2 be P, R, Q.\n\nQuestion2: It took runner1 X':Y':Z', runner2 2:10:40, and runner3 0:50:10 hours:minutes:seconds to finish the race. If on average, it took the three runners H:M:S to finish the rance, report the values of H, M and S. Your answer should be the hours, minutes, and seconds, respectively, without the units (for example, 1, 58, 10).\n\nLet P' = P + 1990, R' = R - 38, and Q' = Q + 16.\n\nUse these values to answer Question3.\n\nQuestion3: If the date for today in yyyy-mm-dd format is P'-R'-Q', what was the date 6 days ago in the same format? If the question cannot be answered, reply \"unanswerable\". Use the date format in the question to answer the question.", "source": "medium_time_arithmetic_p0.json", "gt_answer": "unanswerable"}, "hard_buggy_tables_p1.json": {"question": "I have a table with 26 rows (including the header) and 18 columns. The table was converted to markdown format as follows:\n\n| date |num_steps|study_minutes|exercise_minutes|sleep_minutes|bed_time|num_messages|num_emails|num_calls|calories_burned|weekday|calories_consumed|num_meetings|coding_minutes|num_tasks_completed|water_intake_ml|phone_screen_time_minutes|music_listening_minutes |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| 2025-01-27 && 2025-01-26| 1583 && 10674| 85 && 78| null && 86| 562 && 491| 22:54 && 21:31| 76 && 21| 2 && 10| 7 && 7| 965 && 403| Mon && Tue| 1047 && 1895| 6 && 10| 33 && 9| 2 && 1| 1754 && 1287| 28 && 30| 23 && null |\n| 2025-01-25 && 2025-01-24| 7123 && 7511| 26 && null| null && 21| 580 && 340| 22:53 && null| 40 && 81| 6 && 7| 9 && 7| 223 && 259| Wed && null| 1778 && 959| 9 && 15| null && 36| 4 && 8| 1416 && 2452| 11 && 51| 25 && 52 |\n| 2025-01-23 && 2025-01-22| 14179 && 10384| 95 && 21| 99 && 23| 404 && 383| 21:56 && 23:24| 18 && 72| 3 && 2| 4 && 4| 783 && 384| Fri && Sat| 882 && 414| 15 && 3| 37 && 22| 6 && null| 2379 && 754| 18 && 19| 57 && 17 |\n| 2025-01-21 && 2025-01-20| 11894 && 16041| 59 && 54| 50 && 10| 541 && 589| 21:55 && 21:20| 82 && 51| 10 && 7| 8 && 8| 868 && 274| Sun && null| 413 && 1083| 9 && 5| 38 && null| 4 && 3| null && 1421| null && 35| 14 && 48 |\n| 2025-01-19 && 2025-01-18| null && null| 28 && 84| 33 && 97| 411 && 566| 21:50 && 21:14| 31 && 56| 6 && 2| 8 && 4| 855 && 841| Tue && Wed| 1891 && 592| 7 && 9| 13 && 14| 9 && 5| 2975 && 1028| 60 && 20| 51 && 19 |\n| 2025-01-17 && 2025-01-16| 16366 && 9404| 36 && null| 44 && 68| 342 && 411| 21:55 && 23:19| 93 && 88| 5 && 8| 6 && 5| 755 && 585| Thu && Fri| 689 && 1519| 10 && 12| 24 && 29| 9 && 6| 1012 && 935| 31 && 39| 33 && 11 |\n| 2025-01-15 && 2025-01-14| 17714 && 17541| 38 && 90| 15 && 74| 548 && null| 23:41 && 22:46| 38 && 16| 5 && 6| 10 && 5| null && 283| Sat && null| 889 && 740| 5 && 4| 19 && 61| 9 && 4| 2076 && null| 34 && 30| 36 && 28 |\n| 2025-01-13 && 2025-01-12| 2076 && 19225| 40 && 44| 89 && 93| 327 && 424| 23:55 && 22:18| 26 && 86| null && 9| 3 && 5| 886 && 918| Mon && Tue| 819 && 729| 11 && 6| 25 && 50| 4 && 10| 1093 && 1009| 36 && 33| 27 && 53 |\n| 2025-01-11 && 2025-01-10| 3699 && 11162| 33 && 56| 51 && null| 409 && 582| 22:11 && null| 11 && 88| 9 && 2| 6 && 5| 664 && 678| Wed && Thu| 1997 && null| 13 && null| 56 && null| 5 && 8| 556 && 1059| 57 && 15| 24 && 36 |\n| 2025-01-09 && 2025-01-08| null && 10795| 76 && 10| 95 && 64| 385 && 455| 21:46 && 22:28| 63 && 54| null && 10| 7 && 1| null && 138| Fri && Sat| 447 && null| 12 && 6| 65 && 4| 9 && 9| 857 && 2882| 57 && null| 36 && 17 |\n| 2025-01-07 && 2025-01-06| 11558 && null| 82 && 72| 57 && 41| 524 && 515| 23:25 && null| 22 && 52| 10 && 6| null && 4| 573 && 484| Sun && null| 851 && 1068| 10 && 6| 22 && null| 10 && 10| 613 && 1727| null && 13| null && 48 |\n| 2025-01-05 && 2025-01-04| 11847 && 17416| 60 && 50| 12 && 20| 366 && 392| null && 22:32| 59 && 63| 4 && 4| 4 && 5| 102 && 993| Tue && Wed| 559 && 1155| 3 && null| 65 && 65| null && 1| 845 && 1849| 45 && 39| null && null |\n| 2025-01-03 && null| 10358 && null| 35 && null| null && null| 397 && null| 23:29 && null| 75 && null| 4 && null| 1 && null| null && null| Thu && null| null && null| 9 && null| 10 && null| 10 && null| 913 && null| 16 && null| 20 && null |.\n\nHowever, the code to convert the table into markdown format was buggy and mistakenly merged every two rows of values (not including the header) into one row by placing the values of the second row after the first row separated by \" && \". In the case of an odd number of rows, the last row was merged with a row full of \"null\" values. Compute the absolute difference between the stdev of column sleep_minutes and column coding_minutes, only looking at the days where the number of emails was greater than 2 and the number of steps was less than 17000. Round the result to 2 decimal places. If it cannot be determined whether the condition is satisfied or not (e.g., due to null values that cannot be inferred from the rest of the table), assume the condition is not satisfied. If a value is null, ignore it from the computations. If any of the stdevs cannot be computed due to there being no values, the final answer must be \"0\". If there is only one value, the stdev must be 0. ", "source": "hard_buggy_tables_p1.json", "gt_answer": "67.75"}, "hard_buggy_tables_p0.json": {"question": "I have a table with 36 rows (including the header) and 18 columns. The table was converted to markdown format as follows:\n\n| date |num_steps|study_minutes|exercise_minutes|sleep_minutes|bed_time|num_messages|num_emails|num_calls|calories_burned|weekday|calories_consumed|num_meetings|coding_minutes|num_tasks_completed|water_intake_ml|phone_screen_time_minutes|music_listening_minutes |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| 2025-01-27| 9300 | ERROR| 27   | 388  | 23:22| 23   | 7    | 4    | 488  | null | 1133 | 15   | 2    | 9    | 2589 | null | 26    |\n| 2025-01-26| 12267| 33   | 24   | 569  | ERROR| 61   | 10   | 7    | 503  | null | 1593 | 3    | 6    | 1    | 756  | 44   | 37    |\n| 2025-01-25| 1563 | ERROR| 91   | 310  | 23:25| 34   | 10   | 2    | 484  | ERROR| 1294 | 4    | 55   | 9    | 1109 | 24   | 31    |\n| 2025-01-24| 11306| 66   | 97   | 508  | 22:43| 15   | 6    | 7    | 752  | Thu  | 1791 | 8    | 6    | null | ERROR| ERROR| 55    |\n| 2025-01-23| ERROR| ERROR| 20   | 581  | 21:18| 23   | 6    | null | 845  | Fri  | null | 2    | 19   | 8    | ERROR| 30   | 29    |\n| 2025-01-22| 10331| 100  | 100  | 353  | 21:38| null | 7    | 5    | null | Sat  | 1560 | ERROR| 6    | ERROR| ERROR| ERROR| 45    |\n| 2025-01-21| 19712| 13   | 98   | 321  | 23:40| 13   | ERROR| 2    | 991  | Sun  | 703  | ERROR| 52   | 2    | ERROR| 23   | 38    |\n| 2025-01-20| 7385 | 26   | 33   | 337  | ERROR| null | 10   | 1    | null | null | 1235 | 1    | null | 6    | 1583 | 33   | 11    |\n| 2025-01-19| 9616 | ERROR| 90   | 428  | 23:36| 30   | 2    | ERROR| 460  | Tue  | 1116 | 13   | 0    | 6    | ERROR| 57   | 41    |\n| 2025-01-18| 16634| 25   | 98   | 470  | 23:30| null | null | 3    | 204  | ERROR| 1169 | ERROR| 11   | ERROR| ERROR| 45   | 27    |\n| 2025-01-17| 4505 | ERROR| 16   | 379  | 22:18| 78   | 4    | 10   | null | Thu  | 657  | 6    | 62   | 6    | 1436 | 18   | 20    |\n| 2025-01-16| 3035 | 20   | 74   | ERROR| 22:16| 77   | ERROR| 9    | 449  | Fri  | 1695 | 13   | 17   | 10   | ERROR| 59   | 26    |\n| 2025-01-15| 11708| 64   | null | null | null | 72   | ERROR| 6    | ERROR| Sat  | null | 6    | 10   | 6    | 1635 | 18   | 15    |\n| 2025-01-14| 13002| 58   | 94   | 468  | 23:36| 67   | 1    | 5    | 279  | ERROR| 740  | 1    | 7    | 7    | null | 30   | 28    |\n| 2025-01-13| 18562| 72   | 94   | 393  | 22:39| 26   | 1    | 9    | null | null | 1518 | ERROR| 47   | 4    | 2583 | 40   | 14    |\n| 2025-01-12| 9554 | 70   | 57   | 430  | 23:13| 14   | 1    | 6    | 408  | Tue  | 1517 | 1    | 58   | 4    | 2150 | 38   | 49    |\n| 2025-01-11| 2858 | 41   | 77   | 444  | 22:10| 82   | 8    | 2    | 139  | Wed  | 1878 | ERROR| 18   | 2    | 2593 | null | 18    |\n| 2025-01-10| 9584 | 74   | 15   | null | 22:12| 17   | 5    | 1    | 589  | Thu  | ERROR| 7    | 15   | null | 2032 | 21   | 14    |\n| 2025-01-09| 6578 | 92   | 18   | 545  | 23:30| ERROR| 8    | null | 829  | ERROR| 978  | 15   | 35   | 3    | 1614 | 10   | 41    |\n| 2025-01-08| null | 49   | null | ERROR| 23:42| ERROR| 5    | 3    | 760  | ERROR| 1914 | 6    | 4    | 10   | 2830 | null | 51    |\n| 2025-01-07| 17572| 88   | 27   | 426  | ERROR| 55   | 5    | 5    | 436  | Sun  | 1301 | ERROR| 54   | ERROR| ERROR| 34   | 27    |\n| 2025-01-06| 811  | ERROR| 54   | 524  | 23:38| 10   | 2    | null | 440  | null | 1660 | 7    | 29   | 4    | 984  | 21   | null  |\n| 2025-01-05| 12842| 59   | 27   | 451  | 21:37| 11   | 8    | ERROR| 707  | null | ERROR| 11   | 0    | null | 1052 | ERROR| 27    |\n| 2025-01-04| 4977 | 14   | null | 364  | 23:31| 12   | 5    | null | 810  | Wed  | 1195 | 12   | 3    | 4    | 2331 | 52   | 14    |\n| 2025-01-03| 18133| 99   | 83   | null | 22:37| 47   | 7    | 8    | 943  | Thu  | 1710 | 14   | null | 2    | 1157 | 60   | 49    |\n| 2025-01-02| 16281| 95   | ERROR| 504  | 23:51| null | null | 9    | 709  | Fri  | 525  | 3    | 33   | 2    | ERROR| 58   | 26    |\n| 2025-01-01| null | 85   | 15   | ERROR| 21:41| 34   | 7    | 1    | 581  | Sat  | 570  | 9    | 62   | 4    | 2168 | 38   | 24    |\n| 2024-12-31| 9905 | 78   | ERROR| 564  | 22:43| 92   | 1    | 4    | 221  | ERROR| 493  | 8    | null | 4    | 1453 | 10   | 35    |\n| 2024-12-30| 18182| 35   | 28   | 530  | 21:24| 47   | 5    | 9    | 667  | null | 1169 | 8    | 32   | 7    | 2951 | 22   | 55    |\n| 2024-12-29| null | 91   | null | ERROR| 21:34| 32   | 2    | ERROR| 116  | ERROR| ERROR| 5    | null | 5    | 2054 | 14   | 58    |\n| 2024-12-28| 3303 | null | null | 428  | 23:34| 27   | 9    | ERROR| 101  | Wed  | 957  | 6    | 17   | null | 642  | null | ERROR |\n| 2024-12-27| null | null | 89   | null | 22:52| ERROR| 5    | 5    | 638  | Thu  | 1202 | 10   | 34   | 8    | 2008 | 46   | 49    |\n| 2024-12-26| 13948| ERROR| 30   | 380  | 22:13| 50   | 2    | 9    | 917  | Fri  | 426  | 12   | null | 5    | 2741 | ERROR| 11    |\n| 2024-12-25| 17181| 100  | null | 349  | 21:30| 29   | 10   | 7    | 893  | null | null | 1    | 63   | 4    | 1201 | 29   | 10    |\n| 2024-12-24| 12702| 43   | 74   | 318  | 23:36| 77   | 2    | 6    | 830  | ERROR| 1684 | 7    | 62   | 5    | 2897 | 22   | ERROR |.\n\nHowever, the code to convert the table into markdown format was buggy and mistakenly replaced some values with \"ERROR\". The values for those cells in column-order are respectively as follows: [4003, 54, 55, 35, 66, null, 36, 26, 81, 14, 559, 305, null, null, 23:58, null, 21:16, 78, null, 13, 5, 1, 4, 7, 1, 10, 8, 919, Wed, Wed, Sun, Fri, Sat, Sun, Tue, Sun, 1767, 696, 331, 10, 14, 11, null, 3, 3, 9, 7, 4, 1073, 1174, 876, 2026, 2077, 927, 2634, 757, 1197, 40, 56, 12, 12, 42, 19]. Compute the absolute difference between the median of column sleep_minutes and column study_minutes, only looking at the days where the phone screen time minutes was greater than 25 and the number of calories burned was less than 800. Round the result to 2 decimal places. If it cannot be determined whether the condition is satisfied or not (e.g., due to null values that cannot be inferred from the rest of the table), assume the condition is not satisfied. If a value is null, ignore it from the computations. If any of the medians cannot be computed due to there being no values, the final answer must be \"0\". ", "source": "hard_buggy_tables_p0.json", "gt_answer": "404.0"}, "easy_disambiguation_qa_p0.json": {"question": "Here is a sentence with pronoun(s) whose antecedent(s) can either be derived from the context or is ambiguous.\nSentence: The undergraduate and the scientist visited the lab that needed an assistant. It turned out he was very qualified and so was immediately hired on the spot.\nWhich of the following options correctly explains the antecedent(s) of the pronoun(s)?\n(A) The scientist needed an assistant and was qualified for the job.\n(B) The scientist needed an assistant and the undergraduate student was qualified for the job.\n(C) The student needed an assistant and was qualified for the job.\n(D) The student needed an assistant and the scientist was qualified for the job.\n(E) Ambiguous.", "source": "easy_disambiguation_qa_p0.json", "gt_answer": "(B)"}, "easy_causal_understanding_p1.json": {"question": "Lauren and Jane work for the same company. They each need to use a computer for work sometimes. Unfortunately, the computer isn't very powerful. If two people are logged on at the same time, it usually crashes. So the company decided to institute an official policy. It declared that Jane would be the only one permitted to use the computer in the mornings and that Lauren would be the only one permitted to use the computer in the afternoons. As expected, Jane logged on the computer the next day at 9:00 am. But Lauren decided to disobey the official policy. She also logged on at 9:00 am. The computer crashed immediately. Did Jane cause the computer to crash?  Reply Yes or No based on the answer the majority of people would give. If you think people would be split roughly 50-50 between Yes and No then reply Ambiguous.", "source": "easy_causal_understanding_p1.json", "gt_answer": "Yes"}, "hard_object_counting_p0.json": {"question": "I have 3 fuji apples (it is a funny story how I have 3 of them: initially I had 49, then I also got another 40 making it a total of 89, then I got another 60 making it a total of 149, but then I lost 146 of them so eventually I am left with 3 of them now). My brother has 47 samsung galaxy a55 mobiles. My mother has 15 clementinefigs. I also have 69 alligators (here is why I have these many: initially I had 36 of them, then I lost 33 of them, but then I got another 73 of them, but then I lost 7 of them, so at the end I am left with 69 of them). My grandfather has 79 papayas. My sister has 30 raspberrys. My mother also has 5 huawei pura 70 pro mobiles. I also have 54 quinces (it is a funny story how I have 54 of them: initially I had 17, then I also got another 53 making it a total of 70, then I got another 27 making it a total of 97, but then I lost 43 of them so eventually I am left with 54 of them now). I also have 96 iphone x mobiles (here is why I have these many: initially I had 45 of them, then I lost 19 of them, but then I got another 75 of them, but then I lost 5 of them, so at the end I am left with 96 of them). My grandmother has 92 huawei pura 70 pro+ mobiles. I also have 99 crabs (it is a funny story how I have 99 of them: initially I had 84, then I also got another 24 making it a total of 108, then I got another 33 making it a total of 141, but then I lost 42 of them so eventually I am left with 99 of them now). My brother also has 38 kiwis. I also have 55 autumn royal grapes (here is why I have these many: initially I had 76 of them, then I lost 19 of them, but then I got another 11 of them, but then I lost 13 of them, so at the end I am left with 55 of them). My grandfather also has 18 buffaloes. My aunt has 62 motorola mobiles. I also have 18 lemons (feeling great about this). My sister also has 53 pigeons. My uncle has 17 macaws. I also have 70 huawei mate 70 mobiles (it is a funny story how I have 70 of them: initially I had 81, then I also got another 26 making it a total of 107, then I got another 92 making it a total of 199, but then I lost 129 of them so eventually I am left with 70 of them now). My friend has 22 lemurs. I also have 35 iphone 5 mobiles (I really like them). My brother also has 7 honeycrisp apples. My cousin has 20 chickens. I also have 43 whales (it is a funny story how I have 43 of them: initially I had 52, then I also got another 84 making it a total of 136, then I got another 18 making it a total of 154, but then I lost 111 of them so eventually I am left with 43 of them now). I also have 27 swans (one day, I will have more of them). I also have 68 huawei pura 70 ultra mobiles (received them last month). My mother also has 10 zte mobiles. I also have 66 chardonnay grapes (it is a funny story how I have 66 of them: initially I had 29, then I also got another 14 making it a total of 43, then I got another 59 making it a total of 102, but then I lost 36 of them so eventually I am left with 66 of them now). My cousin also has 15 breadfruits. I also have 39 infinix mobiles (here is why I have these many: initially I had 62 of them, then I lost 50 of them, but then I got another 95 of them, but then I lost 68 of them, so at the end I am left with 39 of them). I also have 66 cantaloupes (it is a funny story how I have 66 of them: initially I had 59, then I also got another 56 making it a total of 115, then I got another 53 making it a total of 168, but then I lost 102 of them so eventually I am left with 66 of them now). My grandmother also has 32 persimmons. My father has 56 elks. My sister also has 67 spartan apples. My mother also has 6 grapefruits. My grandfather also has 63 huawei nova 11 se mobiles. My aunt also has 84 chameleons. I also have 93 apricots (one day, I will have more of them). I also have 90 hawks (here is why I have these many: initially I had 38 of them, then I lost 13 of them, but then I got another 100 of them, but then I lost 35 of them, so at the end I am left with 90 of them). My mother also has 77 iphone 11 mobiles. My grandfather also has 41 syrah grapes. I also have 81 cotton candy grapes (feeling great about this). I also have 38 blackberry mobiles (feeling great about this). My father also has 48 merlot grapes. My aunt also has 80 dates. I also have 98 vultures (they were given to me as a gift). My friend also has 27 realme mobiles. My father also has 70 snails. I also have 26 iphone 8 mobiles (I really like them). My mother also has 26 baboons. I also have 65 owls (received them yesterday). My grandfather also has 90 pears. My friend also has 21 hippopotamus. I also have 57 gala apples (here is why I have these many: initially I had 58 of them, then I lost 38 of them, but then I got another 96 of them, but then I lost 59 of them, so at the end I am left with 57 of them). I also have 81 kangaroos (here is why I have these many: initially I had 87 of them, then I lost 22 of them, but then I got another 82 of them, but then I lost 66 of them, so at the end I am left with 81 of them). My uncle also has 6 salamanders. My friend also has 17 samsung galaxy a15 mobiles. I also have 26 plums (very happy to have them). I also have 18 bananas (one day, I will have more of them). My father also has 95 oneplus mobiles. My mother also has 85 hedgehogs. My mother also has 69 salmon. My friend also has 11 mulberrys. My friend also has 19 mosquitoes. My sister also has 19 nokia mobiles. My grandmother also has 29 envy apples. My uncle also has 84 huawei nova 13 mobiles. I also have 25 blueberrys (received them last week). My brother also has 37 samsung galaxy m55s mobiles. My brother also has 15 cockroaches. My grandmother also has 18 plantains. My cousin also has 34 hamsters. I also have 95 crows (received them yesterday). My grandfather also has 50 sheep. My cousin also has 99 grenache grapes. My cousin also has 40 riesling grapes. My grandfather also has 27 coconuts. My cousin also has 69 orangutans. I also have 22 starfruits (they were given to me as a gift). I also have 53 pinot noir grapes (it is a funny story how I have 53 of them: initially I had 77, then I also got another 35 making it a total of 112, then I got another 37 making it a total of 149, but then I lost 96 of them so eventually I am left with 53 of them now). My brother also has 25 honor mobiles. My friend also has 71 nebbiolo grapes. My grandmother also has 34 samsung galaxy tab s10 mobiles. I also have 4 peaches (it is a funny story how I have 4 of them: initially I had 99, then I also got another 92 making it a total of 191, then I got another 14 making it a total of 205, but then I lost 201 of them so eventually I am left with 4 of them now). My father also has 28 king cobra snakes. I also have 61 stingrays (happt to have them). My uncle also has 95 meizu mobiles. I also have 64 watermelons (it is a funny story how I have 64 of them: initially I had 39, then I also got another 27 making it a total of 66, then I got another 62 making it a total of 128, but then I lost 64 of them so eventually I am left with 64 of them now). I also have 63 newts (here is why I have these many: initially I had 97 of them, then I lost 28 of them, but then I got another 24 of them, but then I lost 30 of them, so at the end I am left with 63 of them). I also have 93 samsung galaxy z fold6 mobiles (it is a funny story how I have 93 of them: initially I had 35, then I also got another 47 making it a total of 82, then I got another 76 making it a total of 158, but then I lost 65 of them so eventually I am left with 93 of them now). I also have 95 muscat grapes (hope to have more in the future). My cousin also has 81 magpies. I also have 45 garter snakes (planning to have more in the future). My cousin also has 57 apes. I also have 5 tecno mobiles (I am in love with them).  What is the sum of the total number of fruits and mobiles that I have?", "source": "hard_object_counting_p0.json", "gt_answer": "1270"}, "hard_object_counting_p1.json": {"question": "My mother has 21 iphone 13 mobiles. My brother has 29 electric bass. My aunt has 78 double bass. I have 85 snails (received them last week). I also have 15 electric cellos (here is why I have these many: initially I had 53 of them, then I lost 10 of them, but then I got another 34 of them, but then I lost 62 of them, so at the end I am left with 15 of them). I also have 82 n'gonis (it is a funny story how I have 82 of them: initially I had 70, then I also got another 40 making it a total of 110, then I got another 20 making it a total of 130, but then I lost 48 of them so eventually I am left with 82 of them now). My brother also has 34 harmonicas. I also have 96 cockroaches (they are great). My mother also has 8 autoharps. My brother also has 52 trombones. My father has 74 honor mobiles. My uncle has 68 tecno mobiles. My grandfather has 23 iphone 16 mobiles. My aunt also has 28 camels. My aunt also has 85 glockenspiels. My sister has 39 kotoes. My father also has 23 salmon. My brother also has 98 butterflys. I also have 29 huawei nova 12 pro mobiles (feeling great about this). My aunt also has 41 drums. My uncle also has 62 timpanis. My mother also has 80 xiaomi mobiles. My brother also has 65 iphone 14 mobiles. I also have 23 samsung galaxy f05 mobiles (I do not think I need this much). My grandfather also has 73 bass guitars. My father also has 78 samsung galaxy s24 mobiles. My sister also has 19 huawei nova 12s mobiles. I also have 18 xylophones (it is a funny story how I have 18 of them: initially I had 27, then I also got another 24 making it a total of 51, then I got another 17 making it a total of 68, but then I lost 50 of them so eventually I am left with 18 of them now). I also have 86 samsung galaxy z fold5 mobiles (I like these a lot). My cousin has 47 crows. I also have 54 accordions (it is a funny story how I have 54 of them: initially I had 82, then I also got another 10 making it a total of 92, then I got another 67 making it a total of 159, but then I lost 105 of them so eventually I am left with 54 of them now). I also have 54 pianos (they are great). I also have 58 iphone 5 mobiles (received them yesterday). My cousin also has 39 zte mobiles. I also have 86 huawei mate 70 mobiles (feeling good about this). I also have 97 tigers (they are great). My mother also has 25 trout. My uncle also has 10 rababs. My mother also has 21 nadaswarams. My father also has 16 violins. I also have 67 frogs (it is a funny story how I have 67 of them: initially I had 22, then I also got another 85 making it a total of 107, then I got another 27 making it a total of 134, but then I lost 67 of them so eventually I am left with 67 of them now). My aunt also has 27 dogs. My aunt also has 49 orangutans. My friend has 27 french horns. I also have 78 tambourines (they were given to me as a gift). My uncle also has 23 panpipes. I also have 87 motorola mobiles (received them yesterday). I also have 97 electric drums (thrilled to have these). My grandfather also has 32 iphone 4 mobiles. My uncle also has 62 iphone 7 mobiles. I also have 92 hawks (I am in love with them). I also have 59 ukuleles (it is a funny story how I have 59 of them: initially I had 28, then I also got another 81 making it a total of 109, then I got another 82 making it a total of 191, but then I lost 132 of them so eventually I am left with 59 of them now). My brother also has 96 samsung galaxy z fold6 mobiles. I also have 60 huawei nova 11 se mobiles (I really like them). My uncle also has 17 iphone 15 mobiles. My sister also has 63 lutes. My sister also has 20 flutes. My cousin also has 11 tanpuras. My grandfather also has 83 huawei pura 70 ultra mobiles. My aunt also has 89 nokia mobiles. I also have 11 theremins (one day, I will have more of them). My grandmother has 46 vivo mobiles. My grandfather also has 40 congas. My friend also has 2 doves. My aunt also has 92 kazoos. My mother also has 46 sharks. My sister also has 22 clavichords. My grandfather also has 24 sitars. My cousin also has 87 mamba snakes. My cousin also has 42 impalas. My mother also has 13 mandolins. My father also has 57 koras. I also have 64 organs (it is a funny story how I have 64 of them: initially I had 31, then I also got another 73 making it a total of 104, then I got another 94 making it a total of 198, but then I lost 134 of them so eventually I am left with 64 of them now). My friend also has 38 lizards. My sister also has 48 prairie dogs. I also have 84 rebecs (it is a funny story how I have 84 of them: initially I had 84, then I also got another 48 making it a total of 132, then I got another 11 making it a total of 143, but then I lost 59 of them so eventually I am left with 84 of them now). I also have 46 tablas (here is why I have these many: initially I had 23 of them, then I lost 14 of them, but then I got another 92 of them, but then I lost 55 of them, so at the end I am left with 46 of them). My grandfather also has 2 oboes. My mother also has 38 shehnais. My sister also has 59 electric pianos. I also have 12 guitars (very happy to have them). My sister also has 84 tamburas. My mother also has 52 crocodiles. My father also has 81 zithers. I also have 77 djembes (one day, I will have more of them). My father also has 7 shamisens. I also have 94 samsung galaxy c55 mobiles (I like these a lot). I also have 94 meizu mobiles (planning to have more in the future). My brother also has 49 htc mobiles. My father also has 21 mridangams. My sister also has 89 iphone 11 mobiles. My grandmother also has 28 biwas. I also have 94 storks (very happy to have them). My cousin also has 80 boars. I also have 18 echidnas (hope to have more in the future). My sister also has 54 iphone 12 mobiles. I also have 35 lemurs (here is why I have these many: initially I had 73 of them, then I lost 57 of them, but then I got another 47 of them, but then I lost 28 of them, so at the end I am left with 35 of them). I also have 90 goats (received them yesterday). I also have 26 geese (maybe I just need some of them). My aunt also has 22 iphone x mobiles. I also have 88 mbiras (it is a funny story how I have 88 of them: initially I had 75, then I also got another 48 making it a total of 123, then I got another 20 making it a total of 143, but then I lost 55 of them so eventually I am left with 88 of them now). My aunt also has 55 parrots. I also have 16 ants (here is why I have these many: initially I had 33 of them, then I lost 19 of them, but then I got another 71 of them, but then I lost 69 of them, so at the end I am left with 16 of them). I also have 55 hummingbirds (they were given to me as a gift). I also have 81 bisons (hope to have more in the future). I also have 62 recorders (I am in love with them). I also have 23 samsung galaxy a16 mobiles (received them last month). I also have 81 wasps (here is why I have these many: initially I had 80 of them, then I lost 13 of them, but then I got another 82 of them, but then I lost 68 of them, so at the end I am left with 81 of them). My aunt also has 95 python snakes. My brother also has 21 roosters. I also have 78 guinea pigs (I do not think I need this much). My friend also has 20 cattles. My sister also has 24 rats. My friend also has 14 oneplus mobiles. My cousin also has 95 reindeer. I also have 27 harps (here is why I have these many: initially I had 76 of them, then I lost 53 of them, but then I got another 38 of them, but then I lost 34 of them, so at the end I am left with 27 of them). My brother also has 96 huawei pura 70 mobiles. My aunt also has 36 samsung galaxy a15 mobiles.  What is the absolute difference of the total number of musical instruments and mobiles that I have?", "source": "hard_object_counting_p1.json", "gt_answer": "288"}, "easy_causal_understanding_p0.json": {"question": "Lauren and Jane work for the same company. They each need to use a computer for work sometimes. Unfortunately, the computer isn't very powerful. If two people are logged on at the same time, it usually crashes. So the company decided to institute an official policy. It declared that Lauren would be the only one permitted to use the computer in the mornings and that Jane would be the only one permitted to use the computer in the afternoons. As expected, Lauren logged on the computer the next day at 9:00 am. But Jane decided to disobey the official policy. She also logged on at 9:00 am. The computer crashed immediately. Did Jane cause the computer to crash?  Reply Yes or No based on the answer the majority of people would give. If you think people would be split roughly 50-50 between Yes and No then reply Ambiguous.", "source": "easy_causal_understanding_p0.json", "gt_answer": "Yes"}, "easy_disambiguation_qa_p1.json": {"question": "Here is a sentence with pronoun(s) whose antecedent(s) can either be derived from the context or is ambiguous.\nSentence: The visitor tells the teacher that she likes the cake, and then tells the chef that it was her favorite dish.\nWhich of the following options correctly explains the antecedent(s) of the pronoun(s)?\n(A) The visitor likes cake and the visitor told the chef.\n(B) The teacher likes cake and the teacher told the chef.\n(C) The visitor likes cake and the teacher told the chef.\n(D) The teacher likes cake and the visitor told the chef.\n(E) Ambiguous.", "source": "easy_disambiguation_qa_p1.json", "gt_answer": "(A)"}, "medium_boolean_expressions_p0.json": {"question": "From the following five expressions, only one evaluates to true. Which one is it?\n\n(A) (not (not (not not not (not not (not not not (not not not ((not (7 - (-3 / 1) is greater than -2) or (3 - (-4 / -3) <= -10)) and (max(-3, 8, 3, -1) - min(-3, 8, 3, -1) is greater than 1)) and not not (False)) and not not (max(-8, 1, -8, -5) - min(-8, 1, -8, -5) <= 4)) or not not not (-4 - (-3 / 3) <= -10)) and not not (True)) or (7 * 1 <= -2)) or (True)) or (3 * -7 is less than or equal to -4)\n(B) not (not (not not (not (9 * -1 + 4 * 7 is greater than 9 * -1) or (The capital of Gambia is Banjul.)) or not not not (not not (max(-7, 9, -9, 1) - min(-7, 9, -9, 1) <= 9) or not not not (max(-8, -4, 3, 4) - min(-8, -4, 3, 4) <= 7))) or (not (not not not (max(-9, -6, 4, -3) - min(-9, -6, 4, -3) is greater than 3) and not not (-10 - (9 / 7) > -2)) or (not not not (max(-2, 3, -5, 4) - min(-2, 3, -5, 4) <= 5) and not not (4 - (-5 / -5) > 3)))) and (not not not (not not (not (10 - (10 / 7) > 9) and (The capital of Azerbaijan is Baku.)) or not not not (not not not (max(-9, -5, -2, -8) - min(-9, -5, -2, -8) is greater than 4) and not not (9 * -9 + 6 * -9 <= 3 * 10))) and not not (not not not ((-10 - (5 / 5) > 10) or (-8 - (-7 / 9) > 3)) and not not (not not (2 - (-5 / 8) is greater than 2) or not not not (False))))\n(C) not not not ((not not not (((not (not not (not not ((not (not (((max(-7, 2, 4, -6) - min(-7, 2, 4, -6) is greater than 3) or (False)) or (The capital of Iraq is Beirut.)) and (10 * -1 > 6)) and (-10 * -3 <= -6)) or (max(-9, 7, -8, 6) - min(-9, 7, -8, 6) <= 10)) or not not not (The capital of UAE is Abu Dhabi.)) or not not not (-9 * 1 + -3 * 9 > 1 * 1)) and (The capital of Canada is Toronto.)) and (The capital of Norway is Bergen.)) and (6 * -10 + 9 * -3 > 9 * 2)) and not not (The capital of the Nigeria is Lagos.)) or (-2 * 7 is less than or equal to -10)) and not not (True)\n(D) not (not (not ((not ((not not ((not not not (not not (not (max(-4, 1, 4, -3) - min(-4, 1, 4, -3) is greater than 3) and (-3 * 10 > -6)) or not not not (max(4, -10, -7, 1) - min(4, -10, -7, 1) <= 4)) and not not (-7 - (-3 / 6) <= -8)) and (1 - (7 / -10) <= -6)) or not not not (False)) and (The capital of Nepal is Pokhara.)) and (max(3, -8, -7, -7) - min(3, -8, -7, -7) <= 9)) or (-9 - (-6 / -5) is less than or equal to 9)) or (False)) and (9 * -2 is less than or equal to -1)) and (The capital of Denmark is Copenhagen.)\n(E) not not not (not (not not ((10 * 8 <= 2) or (-6 * 8 + -7 * 7 <= 8 * -5)) or not not not (not (The capital of Nepal is Kathmandu.) and (-1 * -5 + 5 * -9 > -6 * -5))) and (not not not (not (max(-1, -7, -7, 8) - min(-1, -7, -7, 8) is greater than 3) and (-3 * 8 + -2 * 1 <= 9 * 10)) and not not (not (-2 * 5 > -5) and (3 * -2 > 6)))) and not not (not (not (not not not (-8 - (1 / -3) > -1) and not not (5 - (9 / -8) <= -2)) or (not not not (max(-7, -10, -2, 10) - min(-7, -10, -2, 10) is greater than 10) and not not (1 * -1 + -10 * 2 <= 2 * -10))) or (not (not (The capital of Colombia is Bogota.) or (-10 * -8 + 6 * -8 is less than or equal to -8 * 7)) and (not (4 - (5 / 8) is greater than -2) or (1 * -8 + -10 * 6 > -7 * 4))))\n", "source": "medium_boolean_expressions_p0.json", "gt_answer": "(A)"}, "medium_boolean_expressions_p1.json": {"question": "From the following five expressions, only one evaluates to true. Which one is it?\n\n(A) not (not not not ((not ((not not (not not not (not not not ((not not not (not not not ((not not not (not (not not not (9 * 9 + -3 * 6 is greater than -9 * -6) and not not (The capital of Azerbaijan is Ganja.)) or (The capital of the Nigeria is Lagos.)) and not not (-10 * -2 <= -1)) and (-1 - (8 / -10) > 1)) and not not (False)) and not not (10 - (-1 / -3) <= -3)) or (The capital of Canada is Toronto.)) and not not (-4 * -3 + -2 * 4 <= -4 * -5)) and not not (-3 * -5 + 2 * 3 is less than or equal to 4 * -9)) or not not not (False)) and (The capital of UAE is Abu Dhabi.)) or (6 * 8 + 4 * 4 is greater than -3 * -3)) and (The capital of the Nigeria is Lagos.)) and not not (4 * 2 <= 7)) and (-8 * 5 + -2 * -7 > -2 * -5)\n(B) not not not ((not (True) or (-6 * -1 + 8 * -2 > 7 * 5)) or (not (The capital of Nepal is Pokhara.) or (True))) and not not (not (not not not (2 * -10 + -2 * -4 > -1 * 1) and not not (max(2, -4, -5, -8) - min(2, -4, -5, -8) <= 7)) or ((True) or (-4 - (-9 / -4) > 8)))\n(C) not not (not (not not not (not not (not ((not (not not not (not not not (5 * -1 + 4 * 9 is greater than -1 * -6) and not not (3 * -6 is less than or equal to -9)) and not not (-9 * 8 + 9 * -9 > 5 * -1)) or (-3 * -10 + 3 * 4 is less than or equal to -7 * -1)) or (The capital of Denmark is Copenhagen.)) or (-7 * 1 + 10 * -6 is greater than -9 * 10)) or not not not (8 * 1 <= -2)) and not not (-2 * -1 <= -4)) or (9 * 4 <= -5)) or not not not (The capital of Azerbaijan is Baku.)\n(D) not not not (not not not (not not (((not (not (not (not not (not not (not ((not not not (not not (max(8, 1, -7, 9) - min(8, 1, -7, 9) <= 3) or not not not (9 - (-3 / -10) <= 3)) and not not (-5 * 7 + -6 * -8 is less than or equal to 1 * -5)) and (-1 * -6 <= -1)) or (max(-5, 10, -9, 3) - min(-5, 10, -9, 3) <= 9)) or not not not (5 - (2 / 2) is greater than 3)) or not not not (False)) and (max(-10, -8, -6, -8) - min(-10, -8, -6, -8) <= 6)) or (False)) or (7 * 4 > -8)) or (True)) or (max(-2, -4, -8, 6) - min(-2, -4, -8, 6) <= 4)) or not not not (-4 * -9 + -6 * -7 is less than or equal to 8 * -7)) and not not (The capital of Iraq is Beirut.)) and not not (False)\n(E) not (not not (not not not ((The capital of Norway is Oslo.) and (False)) and not not (not (False) and (10 - (-2 / 8) is greater than 9))) or not not not (not not (not not (5 * 7 <= 1) or not not not (False)) or not not not (not not not (False) and not not (-7 * -1 <= -5)))) and (not (not (not not not (True) and not not (max(9, -2, -10, -3) - min(9, -2, -10, -3) <= 5)) and (not (-1 * 6 is less than or equal to -1) and (True))) or (not (not not (9 * 6 > 7) or not not not (max(6, 10, -8, -7) - min(6, 10, -8, -7) is greater than 10)) and (not not not (False) and not not (-6 * -2 + -1 * 2 is greater than 5 * -1))))\n", "source": "medium_boolean_expressions_p1.json", "gt_answer": "(C)"}}